app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book), notice: 'Book was successfully created.'
    else
      @books = Book.all
---
INSERT INTO "books" ("created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?)  [["created_at", "2021-12-29 04:33:17.116759"], ["updated_at", "2021-12-29 04:33:17.116759"], ["title", "koookok"], ["body", "/./"]]
SELECT "books".* FROM "books"